// Написать програму возвидение числа в квадрат!

Console.WriteLine("Введите число: ");
string int_str = Console.ReadLine()!;

int num = int.Parse(int_str);
Console.WriteLine(num * num);
